In [1]:
import numpy as np
import pandas as pd

In [4]:
major = pd.Series(['math','math','chem','chem'])
student_no = pd.Series([1,2,1,2])
name = pd.Series(['John','Joe','Alice','Bob'])
df = pd.DataFrame({'major':major,
                  'student_no':student_no,
                  'name':name})
df

  major  student_no   name
0  math           1   John
1  math           2    Joe
2  chem           1  Alice
3  chem           2    Bob

In [6]:
new_df = df.set_index(['major','student_no'])
new_df

                   name
major student_no
math  1            John
      2             Joe
chem  1           Alice
      2             Bob

In [7]:
new_df.index

MultiIndex([('math', 1),
            ('math', 2),
            ('chem', 1),
            ('chem', 2)],
           names=['major', 'student_no'])

In [9]:
new_df.loc[('math',1)]

name    John
Name: (math, 1), dtype: object

In [10]:
new_df.loc['math']

            name
student_no
1           John
2            Joe

In [12]:
new_df

                   name
major student_no
math  1            John
      2             Joe
chem  1           Alice
      2             Bob

# Create MultiIndex

In [13]:
ind = pd.Index([2,3,5,7])
ind

Int64Index([2, 3, 5, 7], dtype='int64')

In [17]:
ind = pd.MultiIndex.from_tuples([
    ('math',1),
    ('math',2),
    ('chem',1),
    ('chem',2)
])
ind

MultiIndex([('math', 1),
            ('math', 2),
            ('chem', 1),
            ('chem', 2)],
           )

In [26]:
ind = pd.MultiIndex.from_arrays([
    ['math','math','chem','chem'],
    [1,2,1,2]
])
ind

MultiIndex([('math', 1),
            ('math', 2),
            ('chem', 1),
            ('chem', 2)],
           )

In [27]:
ind = pd.MultiIndex.from_product([
    ['math','chem'],
    [1,2]
])
ind

MultiIndex([('math', 1),
            ('math', 2),
            ('chem', 1),
            ('chem', 2)],
           )

In [25]:
ddf = df.copy()
ddf.index = ind ### change the attribute "index"
# ddf.reindex(ind) ### use the reindex function to change
ddf

       major  student_no   name
math 1  math           1   John
     2  math           2    Joe
chem 1  chem           1  Alice
     2  chem           2    Bob

In [33]:
new_df = df.set_index(['major','student_no'])
new_df

                   name
major student_no
math  1            John
      2             Joe
chem  1           Alice
      2             Bob

In [36]:
new_df.reset_index()

  major  student_no   name
0  math           1   John
1  math           2    Joe
2  chem           1  Alice
3  chem           2    Bob

In [38]:
new_df

                   name
major student_no
math  1            John
      2             Joe
chem  1           Alice
      2             Bob

In [42]:
new_df.unstack(level=0)

             name
major        chem  math
student_no
1           Alice  John
2             Bob   Joe

In [46]:
A = new_df.unstack()
A

             name
student_no      1    2
major
chem        Alice  Bob
math         John  Joe

In [47]:
B = A.stack()
B

                   name
major student_no
chem  1           Alice
      2             Bob
math  1            John
      2             Joe

In [53]:
B['score'] = [90,20,50,40]
B

                   name  score
major student_no
chem  1           Alice     90
      2             Bob     20
math  1            John     50
      2             Joe     40

In [57]:
B.mean(level=0) ### aggregate function

       score
major
chem      55
math      45

In [59]:
B.mean(level='major')

       score
major
chem      55
math      45